===================
Equals Expression
===================

some_rule(x) if x = 1;

---
(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (binary_expression
        left: (identifier)
        operator: (comparison_operator)
        right: (int))))


=======================
Greater Than Expression
=======================

some_rule(x) if x > 10;

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (binary_expression
        left: (identifier)
        operator: (comparison_operator)
        right: (int))))


==============================
Greater Than Equals Expression
==============================

some_rule(x) if x >= 10;

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (binary_expression
        left: (identifier)
        operator: (comparison_operator)
        right: (int))))


===========================
Less Than Equals Expression
===========================

some_rule(x) if x <= 10;

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (binary_expression
        left: (identifier)
        operator: (comparison_operator)
        right: (int))))

===================
In Array Expression
===================

some_rule() if x in ["foo", 10, true] and check(x);

---

(source_file
  (rule_definition
    name: (identifier)
    expression: (binary_expression
      left: (binary_expression
        variable: (identifier)
        operator: (in)
        values: (literal_array
          (string)
          (int)
          (bool)))
      operator: (and)
      right: (rule_expression
        name: (identifier)
        argument: (identifier)))))

