=====================================
Rule expression - without body (fact)
=====================================

some_fact();

---

(source_file
  (fact_definition
    name: (identifier)))

================================
Rule expression - zero arguments
================================

some_rule(x) if some_other_fact();

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (rule_expression
        name: (identifier))))

=========================================
Rule expression - boolean (true) argument
=========================================

some_fact(x) if some_other_fact(true);

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (rule_expression
      name: (identifier)
      argument: (bool))))

=========================================
Rule expression - boolean (false) argument
=========================================

some_rule(x) if some_other_fact(false);

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (rule_expression
      name: (identifier)
      argument: (bool))))


===================================
Rule expression - string argument
===================================

some_rule(x) if some_other_fact(x);

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (rule_expression
      name: (identifier)
      argument: (identifier))))


===================================
Rule expression - variable argument 
===================================

some_rule(x) if some_other_fact(x);

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (rule_expression
      name: (identifier)
      argument: (identifier))))


===================================
Rule expression - variable argument 
===================================

some_rule(x) if some_other_fact(x);

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (rule_expression
      name: (identifier)
      argument: (identifier))))

=============================================
Rule expression - variable argument with type 
=============================================

some_rule(x: String) if some_other_fact(x);

---

(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier)
      type: (identifier))
    expression: (rule_expression
      name: (identifier)
      argument: (identifier))))


========================
Rule expression - parens
========================

some_rule(x) if (fact_a(x) or fact_b(x)) and (fact_c(x) or fact_d(x));

---
(source_file
  (rule_definition
    name: (identifier)
    parameter: (parameter
      name: (identifier))
    expression: (binary_expression
      left: (paren_logical_expression
        expression: (binary_expression
          left: (rule_expression
            name: (identifier)
            argument: (identifier))
          operator: (or)
          right: (rule_expression
            name: (identifier)
            argument: (identifier))))
      operator: (and)
      right: (paren_logical_expression
        expression: (binary_expression
          left: (rule_expression
            name: (identifier)
            argument: (identifier))
          operator: (or)
          right: (rule_expression
            name: (identifier)
            argument: (identifier)))))))
